# LocationOnCurve Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointOnEdge..::..LocationOnCurve Property
PointOnEdge Class See Also
---
The point location on curve.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public PointLocationOnCurve LocationOnCurve { get; }
```

Visual Basic
---
```text
Public ReadOnly Property LocationOnCurve As PointLocationOnCurve
	Get
```

Visual C++
---
```text
public:
property PointLocationOnCurve^ LocationOnCurve {
	PointLocationOnCurve^ get ();
}
```

# See Also
PointOnEdge Class
Autodesk.Revit.DB Namespace